@bflad

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_iam_policy_document.describe_cluster will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "describe_cluster"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "eks:DescribeCluster",
            ]
          + resources = [
              + "arn:aws:eks:***:cluster/test",
            ]
        }
    }

  # module.eks.data.template_file.workers_userdata will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "workers_userdata"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = "#!/bin/bash\nset -o xtrace\n/etc/eks/bootstrap.sh --apiserver-endpoint '${cluster_endpoint}' --b64-cluster-ca '${certificate_authority_data}' '${cluster_name}'\n"
      + vars     = {
          + "certificate_authority_data" = "***"
          + "cluster_endpoint"           = "https://***..eks.amazonaws.com"
          + "cluster_name"               = "***"
        }
    }

  # module.eks.aws_autoscaling_group.workers will be updated in-place
  ~ resource "aws_autoscaling_group" "workers" {
        arn                       = "arn:aws:autoscaling:***:autoScalingGroup:***:autoScalingGroupName/test-20190819164056971500000004"
        availability_zones        = [
            "***",
            "***",
        ]
        default_cooldown          = 300
        desired_capacity          = 1
        enabled_metrics           = []
        force_delete              = false
        health_check_grace_period = 300
        health_check_type         = "EC2"
        id                        = "test-20190819164056971500000004"
      ~ launch_configuration      = "test-20190927140853940100000001" -> (known after apply)
        load_balancers            = []
        max_size                  = 1
        metrics_granularity       = "1Minute"
        min_size                  = 1
        name                      = "test-20190819164056971500000004"
        name_prefix               = "test-"
        protect_from_scale_in     = false
        service_linked_role_arn   = "arn:aws:iam::***:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling"
        suspended_processes       = []
        target_group_arns         = []
        termination_policies      = []
        vpc_zone_identifier       = [
            "***",
            "***",
        ]
        wait_for_capacity_timeout = "10m"

        tag {
            key                 = "Name"
            propagate_at_launch = true
        }
        tag {
            key                 = "kubernetes.io/cluster/test"
            propagate_at_launch = true
        }
    }

  # module.eks.aws_eks_cluster.eks will be updated in-place
  ~ resource "aws_eks_cluster" "eks" {
        arn                       = "arn:aws:eks:***:cluster/test"
        certificate_authority     = [
            {
                data = "***"
            },
        ]
        created_at                = "2019-08-19 16:29:44 +0000 UTC"
      ~ enabled_cluster_log_types = [
          - "api",
          - "audit",
        ]
        endpoint                  = "https://***.eks.amazonaws.com"
        id                        = "test"
        name                      = "test"
        platform_version          = "eks.3"
        role_arn                  = "arn:aws:iam::***:role/test-eks-control-plane"
        status                    = "ACTIVE"
        version                   = "1.13"

        vpc_config {
            endpoint_private_access = true
            endpoint_public_access  = true
            security_group_ids      = [
                "***",
            ]
            subnet_ids              = [
                "***",
                "***",
            ]
            vpc_id                  = "***"
        }
    }

  # module.eks.aws_iam_role_policy.admin will be updated in-place
  ~ resource "aws_iam_role_policy" "admin" {
        id     = "test-eks-admin:terraform-20190819164055809600000001"
        name   = "terraform-20190819164055809600000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "eks:DescribeCluster"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:eks:***:cluster/test"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        role   = "test-eks-admin"
    }

  # module.eks.aws_iam_role_policy.developer will be updated in-place
  ~ resource "aws_iam_role_policy" "developer" {
        id     = "test-eks-developer:terraform-20190819164055809900000002"
        name   = "terraform-20190819164055809900000002"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "eks:DescribeCluster"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:eks:***:cluster/test"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        role   = "test-eks-developer"
    }

  # module.eks.aws_launch_configuration.workers must be replaced
+/- resource "aws_launch_configuration" "workers" {
        associate_public_ip_address      = false
      ~ ebs_optimized                    = false -> (known after apply)
        enable_monitoring                = true
        iam_instance_profile             = "test-eks-workers"
      ~ id                               = "test-20190927140853940100000001" -> (known after apply)
        image_id                         = "***"
        instance_type                    = "t3.medium"
      + key_name                         = (known after apply)
      ~ name                             = "test-20190927140853940100000001" -> (known after apply)
        name_prefix                      = "test-"
        security_groups                  = [
            "***",
        ]
      ~ user_data_base64                 = "***" -> (known after apply) # forces replacement
      - vpc_classic_link_security_groups = [] -> null

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      ~ root_block_device {
            delete_on_termination = true
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 0 -> (known after apply)
            volume_size           = 60
          + volume_type           = (known after apply)
        }
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
E.g., removing the EKS logs config: AWS launch config recreation is forced by Terraform thinking that EKS values in user data template will change. This is its config value:
`user_data_base64            = base64encode(data.template_file.workers_userdata.rendered)`